//======================================================================
//文件名称：eye.h
//功能概要：眼睛构件头文件
//    定义描述眼睛的结构体.
//    定义初始化函数.
//    定义根据串口信息刷新眼睛位置的函数.
//======================================================================

#ifndef _EYE_H
#define _EYE_H

#include "stdafx.h"
#include "uart.h"
#include "space.h"
#include "draw.h"

//眼睛.
struct Eye_Eye
{
	Space_Point place;          //眼睛位置(毫米).
	Space_Vector speed;         //眼睛速度(米/秒).
	Space_Vector acceleration;  //眼睛加速度(重力加速度).
};

//传感器.
struct Eye_Sensor
{
	Space_Vector acceleration;  //传感器加速度.
	Space_Vector angle;         //传感器角度.
};

//======================================================================
//函数名称：eye_init
//函数参数：无.
//函数返回：无.
//功能概要：初始化眼睛.
//======================================================================
void eye_init();

//======================================================================
//函数名称：eye_uart
//函数参数：无.
//函数返回：无.
//功能概要：根据串口信息刷新眼睛位置.
//======================================================================
void eye_uart();

//----------------------以下是内部函数----------------------------------

//======================================================================
//函数名称：eye_analyze
//函数参数：无.
//函数返回：无.
//功能概要：解析串口数据.
//======================================================================
void eye_analyze();

//======================================================================
//函数名称：eye_calculate
//函数参数：无.
//函数返回：无.
//功能概要：计算眼睛速度，位置.
//======================================================================
void eye_calculate();

#endif