//======================================================================
//文件名称：draw.h
//功能概要：绘画构件头文件
//    定义所绘画物体，屏幕的结构体.
//    定义初始化函数.
//    定义绘图函数.
//======================================================================

#ifndef _DRAW_H
#define _DRAW_H

#include "stdafx.h"
#include "space.h"

//所绘画物体.
struct Draw_Thing
{
	vector<Space_Line> lines;   //构成物体的线段.
};

//屏幕.
struct Draw_Screen
{
	Space_Point o;              //屏幕原点(左上角).
	Space_Point x_end;          //屏幕x轴终点(右上角).
	Space_Point y_end;          //屏幕y轴终点(左下角).
	Space_Point e;              //屏幕终点(右下角).
	double x_length;            //屏幕x轴长度.
	double y_length;            //屏幕y轴长度.
	int x_pixel;                //屏幕x轴像素.
	int y_pixel;                //屏幕y轴像素.
	Space_Plane plane;          //屏幕所在平面(由o，x_end，y_end确定).
	Space_Line up;              //屏幕上边.
	Space_Line down;            //屏幕下边.
	Space_Line left;            //屏幕左边.
	Space_Line right;           //屏幕右边.
};

//======================================================================
//函数名称：draw_init
//函数参数：无.
//函数返回：无.
//功能概要：初始化所画的物体与屏幕.
//======================================================================
void draw_init();

//======================================================================
//函数名称：draw_draw
//函数参数：eye：眼睛在空间中的位置.
//函数返回：无.
//功能概要：根据眼睛的位置绘制物体在屏幕上的投射.
//======================================================================
void draw_draw(Space_Point eye,HDC hdc);

#endif